zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_ll_exti.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_exti.c
  * @author  MCD Application Team
  * @brief   EXTI LL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
#if defined(USE_FULL_LL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_ll_exti.h"

#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else   /* USE_FULL_ASSERT */
#define assert_param(expr) ((void)0U)
#endif  /* USE_FULL_ASSERT */

/** @addtogroup STM32MP2xx_LL_Driver
  * @{
  */

#if defined (EXTI1) || defined (EXTI2)

/** @defgroup EXTI_LL EXTI
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @addtogroup EXTI_LL_Private_Macros
  * @{
  */


#define IS_LL_EXTI_MODE(__VALUE__)                   (((__VALUE__) == LL_EXTI_MODE_IT)            \
                                                      || ((__VALUE__) == LL_EXTI_MODE_EVENT)         \
                                                      || ((__VALUE__) == LL_EXTI_MODE_IT_EVENT))


#define IS_LL_EXTI_TRIGGER(__VALUE__)                (((__VALUE__) == LL_EXTI_TRIGGER_NONE)       \
                                                      || ((__VALUE__) == LL_EXTI_TRIGGER_RISING)     \
                                                      || ((__VALUE__) == LL_EXTI_TRIGGER_FALLING)    \
                                                      || ((__VALUE__) == LL_EXTI_TRIGGER_RISING_FALLING))

/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @addtogroup EXTI_LL_Exported_Functions
  * @{
  */

/** @addtogroup EXTI_LL_EF_Init
  * @{
  */

/**
  * @brief  De-initialize the EXTI registers to their default reset values.
  * @param  EXTIx EXTI Instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: EXTI registers are de-initialized
  *          - ERROR: not applicable
  */
ErrorStatus LL_EXTI_DeInit(EXTI_TypeDef *EXTIx)
{
  /* Check the parameters */
  assert_param(IS_EXTI_ALL_INSTANCE(EXTIx));

  /* Rising Trigger selection register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, RTSR1, 0x00000000U);

  /* Falling Trigger selection register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, FTSR1, 0x00000000U);

  /* Software interrupt event register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, SWIER1, 0x00000000U);

  /* Pending register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, RPR1, 0x00000000U);

  /* Pending register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, FPR1, 0x00000000U);

  /* Privilege register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, PRIVCFGR1,  0x00000000U);
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  /* Secure register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, SECCFGR1,  0x00000000U);
#endif /* __ARM_FEATURE_CMSE */

  /* Rising Trigger selection register 2 set to default reset values */
  LL_EXTI_WriteReg(EXTIx, RTSR2, 0x00000000U);

  /* Falling Trigger selection register 2 set to default reset values */
  LL_EXTI_WriteReg(EXTIx, FTSR2, 0x00000000U);

  /* Software interrupt event register 2 set to default reset values */
  LL_EXTI_WriteReg(EXTIx, SWIER2, 0x00000000U);

  /* Pending register 2 set to default reset values */
  LL_EXTI_WriteReg(EXTIx, RPR2, 0x00000000U);

  /* Pending register 2 set to default reset values */
  LL_EXTI_WriteReg(EXTIx, FPR2, 0x00000000U);

  /* Privilege register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, PRIVCFGR2,  0x00000000U);
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  /* Secure register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, SECCFGR2,  0x00000000U);
#endif /* __ARM_FEATURE_CMSE */

  /* Rising Trigger selection register 3 set to default reset values */
  LL_EXTI_WriteReg(EXTIx, RTSR3, 0x00000000U);

  /* Falling Trigger selection register 3 set to default reset values */
  LL_EXTI_WriteReg(EXTIx, FTSR3, 0x00000000U);

  /* Software interrupt event register 3 set to default reset values */
  LL_EXTI_WriteReg(EXTIx, SWIER3, 0x00000000U);

  /* Pending register 3 set to default reset values */
  LL_EXTI_WriteReg(EXTIx, RPR3, 0x00000000U);

  /* Pending register 3 set to default reset values */
  LL_EXTI_WriteReg(EXTIx, FPR3, 0x00000000U);

  /* Privilege register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, PRIVCFGR3,  0x00000000U);
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  /* Secure register set to default reset values */
  LL_EXTI_WriteReg(EXTIx, SECCFGR3,  0x00000000U);
#endif /* __ARM_FEATURE_CMSE */

  /* Interrupt mask register set to default reset values */
#if defined (CORE_CM0PLUS)
  LL_EXTI_WriteReg(EXTIx, C3IMR1, 0x00000000U);
#elif defined (CORE_CM33)
  LL_EXTI_WriteReg(EXTIx, C2IMR1, 0x00000000U);
#else   /* CORE_CM0PLUS | CORE_CM33 */
  LL_EXTI_WriteReg(EXTIx, C1IMR1, 0x00000000U);
#endif  /* CORE_CM0PLUS | CORE_CM33 */

  /* Event mask register set to default reset values */
#if defined (CORE_CM0PLUS)
  LL_EXTI_WriteReg(EXTIx, C3EMR1, 0x00000000U);
#elif defined (CORE_CM33)
  LL_EXTI_WriteReg(EXTIx, C2EMR1, 0x00000000U);
#else   /* CORE_CM0PLUS | CORE_CM33 */
  /* LL_EXTI_WriteReg(EXTIx, C1EMR1, 0x00000000U); */
#endif  /* CORE_CM0PLUS | CORE_CM33 */

